
icc2_lm_shell> set_app_options -name lib.workspace.group_libs_combine_physical_only -value false
lib.workspace.group_libs_combine_physical_only false
icc2_lm_shell> set_app_options -name lib.workspace.use_workspace_tech -value true
lib.workspace.use_workspace_tech true
icc2_lm_shell> set_app_options -name lib.workspace.fast_exploration -value true
lib.workspace.fast_exploration true
icc2_lm_shell> set_app_options -name lib.workspace.reuse_lib -value true
lib.workspace.reuse_lib true
icc2_lm_shell> set_app_options -name lib.workspace.create_cached_lib -value true
lib.workspace.create_cached_lib true
icc2_lm_shell> create_workspace saed14rvt_2
... created workspace saed14rvt_2
icc2_lm_shell> read_db /mnt/hgfs/saed14_pdk/stdcell_rvt/db_nldm/saed14rvt_ss0p6v125c.db
Information: Loading db file '/mnt/hgfs/saed14_pdk/stdcell_rvt/db_nldm/saed14rvt_ss0p6v125c.db' (FILE-007)
{saed14rvt_ss0p6v125c}
icc2_lm_shell> read_db /mnt/hgfs/saed14_pdk/stdcell_rvt/db_nldm/saed14rvt_tt0p6v25c.db
Information: Loading db file '/mnt/hgfs/saed14_pdk/stdcell_rvt/db_nldm/saed14rvt_tt0p6v25c.db' (FILE-007)
{saed14rvt_tt0p6v25c}
icc2_lm_shell> read_db /mnt/hgfs/saed14_pdk/stdcell_rvt/db_nldm/saed14rvt_ff0p88v125c.db
Information: Loading db file '/mnt/hgfs/saed14_pdk/stdcell_rvt/db_nldm/saed14rvt_ff0p88v125c.db' (FILE-007)
{saed14rvt_ff0p88v125c}
icc2_lm_shell> read_ndm /mnt/hgfs/saed14_pdk/stdcell_rvt/ndm/saed14rvt_frame_only.ndm
Information: Loading library file '/mnt/hgfs/saed14_pdk/stdcell_rvt/ndm/saed14rvt_frame_only.ndm' (FILE-007)
{saed14rvt_frame_only}
icc2_lm_shell> process_workspaces -check_options {-allow_missing} -output ndm/saed14rvt_2.ndm -force

Checking whether can reuse an existing library for workspace saed14rvt_2 ...
Information: Cannot reuse library ndm/saed14rvt_2.ndm for workspace saed14rvt_2: library not exists. (LMUI-053)
Checking libraries...
Using saed14rvt_ss0p6v125c as the base library.
Warning:  132 missing dynamic power records across all libraries. (LM-001)
Warning: Could not fix all missing dynamic power records (LM-125)
...Aligning missing dynamic power records...
...Building the dynamic power record superset in the base library...
...done.
Warning: Mismatched PG pins between the logic library and FRAME for block saed14rvt_2/SAEDRVT14_ISOFSDPQ_PECO_4:  - Extra DB/power  :  VDD. (LM-033)
Warning: Mismatched PG pins between the logic library and FRAME for block saed14rvt_2/SAEDRVT14_ISOFSDPQ_PECO_8:  - Extra DB/ground :  VSS. (LM-033)
Warning: More than one power pin or ground pin of the antenna diode for design SAEDRVT14_TIEDIN_PV1ECO_6 (LM-107)
Warning: Mismatched PG pins between the logic library and FRAME for block saed14rvt_2/SAEDRVT14_DCAP_PV1ECO_12:  - Extra DB/power  :  VDD VDDR - Extra DB/ground :  VSS. (LM-033)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_AOINV_IW_0P5/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_AOINV_IW_1/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_AOINV_IW_2/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_AOINV_IW_4/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_AOINV_IW_6/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Mismatched PG pins between the logic library and FRAME for block saed14rvt_2/SAEDRVT14_FILL_NNWVDDBRKY2_3:  - Extra DB/power  :  VDD. (LM-033)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_FILLP2/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_FILLP3/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_TAPPP10/VDDR' from physical source (was missing in logical source) (LM-109)
Warning: Copied PG pin 'saed14rvt_2/SAEDRVT14_CAPTTAPP6/VDDR' from physical source (was missing in logical source) (LM-109)
Information: Combined 922 physical designs:922 with a frame view (896 had ports reordered); (LM-034)
Information: Skipped 131 physical designs (LM-052)

Workspace check succeeded!
... wrote ndm/saed14rvt_2.ndm
... removing library 'saed14rvt_ss0p6v125c'
... removing library 'saed14rvt_tt0p6v25c'
... removing library 'saed14rvt_ff0p88v125c'
... removing library 'saed14rvt_frame_only'
... lib workspace removed!

Warning: EMS database "check_workspace.ems" already exists, over-writing it. (EMS-040)
icc2_lm_shell> 